Elements have changed category. Tags for these elements are now of the wrong category and will be deleted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ElementCategoryChangeInvalidatesTag { get; }
  Visual Basic
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesTag As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesTag {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures TagFailures Class
  Autodesk.Revit.DB Namespace